{
  "slides": [
    {
      "key": "title",
      "name": "Title",
      "script": "Welcome to the GBFoods Nordics strategy journey. We start from a strong 2025 baseline of 63.1 million euros and a 41.3 percent gross margin, and we will scale to 100 million by 2029 through consumer obsession and disciplined execution.",
      "text": "LUND • JAN 18, 2026 • GBFOODS NORDICS FROM 63.1 → 100 M€ Consumer-Obsessed • Disciplined Execution • Sustainable Profitability 63.1M€ 2025 Net Sales (Core) 41.3% 2025 Gross Margin 100M€ 2029 Target GM hard gate: < 39.5% Field force gate: uplift < 8% OH ≤ 9% • A&P ≤ 9%"
    },
    {
      "key": "agenda",
      "name": "Agenda",
      "script": "Today we align on the real 2025 starting point, the strategic diagnosis, and the levers that drive value. Then we lock the execution operating system: organization, ways of working, marketing and innovation. Finally, we commit to financial guardrails, KPIs, risk gates, and the roadmap from 2026 to 2029.",
      "text": "Agenda Baseline → diagnosis → levers → operating system → year-by-year roadmap SECTION 1 — STARTING POINT 2025 closing baseline (P&L landing) Market context & strategic diagnosis Ambition & value creation framework SECTION 2 — VALUE CREATION Route to market strategy Field force transition (ROI-gated) Foodservice expansion (focused) SECTION 3 — EXECUTION OS Org & ways of working Marketing & campaign plan NPD plan (health/premium focus) SECTION 4 — DISCIPLINE Financial framework & guardrails KPIs, tools & data Risks, gates & mitigations Implementation roadmap 2026 → 2029 (one slide per year) + summary + next steps."
    },
    {
      "key": "exec_summary",
      "name": "Executive Summary",
      "script": "In one slide: we start from 63.1 million euros at 41.3 percent gross margin. We grow to 100 million by 2029 with roughly 12 percent CAGR, while protecting gross margin above 40 percent. Noodles and broth are the growth engines, execution is the multiplier, and financial discipline is non-negotiable.",
      "text": "Executive Summary 2025 Closing baseline (core) 63.1M€ Net Sales 41.3% GM% 15.2M€ Broth 1.2M€ Noodles EBIT 15.3M€ (24%) 2026–2029 ambition 100M€ net sales by 2029 (~12% CAGR) Protect GM ≥40% (hard gate 39.5% ) Noodles & broth are the primary engines Dedicated field force (staged, ROI-gated) Focused foodservice growth from Sweden base Strict discipline: OH ≤9% and A&P ≤9% Winning equation Availability × execution × brand relevance Scale what works, stop what doesn’t (gates) Consumer obsession as the starting point"
    },
    {
      "key": "pl_landing",
      "name": "2025 Baseline",
      "script": "This is our real baseline: 63.1 million euros with strong volume, broth at 15.2 million and noodles breaking out from a small base. Gross margin is healthy but must be protected. Our job is to keep momentum, fix execution dilution and cost drift, and unlock noodles and broth through disciplined scaling.",
      "text": "2025 Closing Baseline — P&L Landing Metric Value Signal Implication Net Sales (Core) 63.1M€ +7% We have demand momentum — execution converts it. • Noodles 1.2M€ +259% Breakout category; scale with control (availability + repeat). • Broth 15.2M€ +11% Reliable platform; premiumize and defend seasonality. Gross Margin 41.3% -1.2pp Protect mix; gate growth that destroys margin. A&P 5.6% up Room to invest—must be ROI-tracked. Overhead ~8% pressure Scale with discipline; avoid cost drift. EBIT 15.3M€ 24% Strong base; growth must keep profitability quality. KEEP Volume momentum and core brand trust Broth platform strength Profitability baseline FIX Mix pressure & promotional discipline Execution dilution (shared resources) Cost drift risk (A&P + OH) UNLOCK Noodles scale: distribution + repeat RTM standards and field execution Health/premium innovation pipeline"
    },
    {
      "key": "market_context",
      "name": "Market Context",
      "script": "The market grows steadily, but the biggest upside is in foodservice and in the convenience platforms where trust, quality, and health cues matter. Our right to win is strongest in broth and noodles. The constraint is execution quality: availability, shelf standards, and disciplined investment.",
      "text": "Market Context & Strategic Diagnosis 3–5% Nordics packaged food CAGR 4–6% Foodservice CAGR HIGH Brand trust & fit Consumer reality (2026+) Convenience + comfort, but with health cues Premiumization: pay for quality and function Sustainability and transparency are expected Digital discovery influences retail decisions Where we have a right to win Broth: trusted, scalable, seasonal strength Noodles: low penetration + fast adoption Convenience platforms with Nordic taste Foodservice: leverage Sweden base into FI/NO Hard truths Growth without availability is wasted A&P Promo-driven growth risks GM erosion Execution quality is the constraint, not ideas"
    },
    {
      "key": "value_framework",
      "name": "Value Creation",
      "script": "Our value creation is built on four pillars: consumer obsession, premiumization and mix, execution excellence, and disciplined scaling with hard gates. This is how we grow fast without losing profitability quality.",
      "text": "Value Creation Framework Four pillars — engineered growth, not hope. 1) Consumer obsession Insights → decisions → weekly learning loop Quality experience: taste, availability, value NPS ambition: >50 Start with the consumer 2) Mix & premiumization Health/premium NPD as mix engine Protect GM ≥40% Quarterly mix improvement targets Protect margin while scaling 3) Execution excellence RTM standards and shelf ownership Dedicated field force (staged) Foodservice focus with the right formats Own shelf. Own standards. 4) Disciplined scaling Hard gates and stop rules ROI discipline on A&P and headcount Caps: OH ≤9% and A&P ≤9% Controlled aggression"
    },
    {
      "key": "rtm",
      "name": "Route to Market",
      "script": "Route to market is hybrid. We keep direct control in Sweden, and we drive distributor performance in Finland, Norway, Denmark and the Baltics through clear standards and governance. Our target mix by 2029 is roughly 70 to 75 percent retail, 20 to 25 percent foodservice, and selective e-commerce.",
      "text": "Route to Market Strategy Hybrid model (control where it matters) Direct: Sweden (retail + foodservice) Finland: Prescott Norway: Haugen Denmark: Conaxess Baltics: selected local distributors 2029 channel target mix 70–75% Retail • 20–25% Foodservice • 5–10% E-commerce Non-negotiable standards OSA > 95% on focus SKUs Planogram compliance > 90% Promo compliance with evidence Distributor governance Quarterly performance reviews 2-quarter underperformance → corrective plan Repeat underperformance → alternative RTM"
    },
    {
      "key": "field_force",
      "name": "Field Force",
      "script": "Execution is the multiplier. We move from a shared outsourced model to a dedicated GBFoods field force, starting with a 2026 pilot. We only scale if evidence proves impact. Mid-2026 gate: if uplift is under 8 percent, we pause and redesign.",
      "text": "Field Force Transition (Hybrid, ROI-Gated) Current state Outsourced shared force Coverage exists — brand focus and standards are diluted. Target state Dedicated GBFoods force 2026: pilot 5–10 reps (Sweden), clear KPIs 2027: scale to 15–20 reps if gates pass Focus: shelf, availability, promo execution, sampling Hard gate (mid-2026) If uplift 8% , pause rollout and redesign. What “uplift” means (evidence) OSA improvement on focus SKUs Distribution gains on noodles & broth Sell-out acceleration vs control stores Promo compliance and visibility proof"
    },
    {
      "key": "foodservice",
      "name": "Foodservice",
      "script": "Foodservice is our second growth leg. From a 15 million euro Sweden base, we expand carefully into Finland and Norway with the right formats and dedicated account focus. We gate investment: if foodservice growth is below 12 percent by 2027, we reallocate to retail growth levers.",
      "text": "Foodservice B2B Channel Strategy 15M€ 2025 Sweden base 20–25M€ 2029 target (total) Strategy (focused expansion) Leverage Sweden base into Finland + Norway Build B2B/bulk formats and chef-friendly packs Dedicated KAMs on priority segments Trade activation: chefs, shows, distributor programs Hard gate (2027) If FS growth 12% YoY , reallocate investment to retail levers. Focus segments Public sector & institutional (where relevant) QSR and convenience food Workplace and catering Retail-adjacent meal solutions"
    },
    {
      "key": "org",
      "name": "Organization",
      "script": "Organization must match the strategy: clear ownership per channel and platform, fewer handoffs, and embedded insights and S&OP+ rhythm. We optimize for speed and accountability, and we remove dual ownership and priority overload.",
      "text": "Organization Structure Structure follows strategy — clear ownership and faster decisions. What we optimize for Clear accountability per channel & platform Fast decisions: fewer handoffs Strong commercial engine with field execution Innovation and insights embedded, not “side work” Core operating roles GM / leadership team for priorities and gates Commercial / Sales: RTM, customer plans, execution Marketing: brand, demand creation, insights S&OP+: demand/supply alignment, service, portfolio Avoid these failure modes Dual ownership (nobody owns the outcome) Too many priorities (no scale) Investing before availability and execution are stable Decision rights (simple) One owner per KPI Gates trigger automatic review Stop rules are pre-agreed"
    },
    {
      "key": "ways_of_working",
      "name": "Ways of Working",
      "script": "To scale, we need an execution operating system: weekly commercial pulse, monthly S&OP plus, quarterly customer plans, and a disciplined innovation council. The rule is simple: evidence-driven execution, one owner per decision, and gates that trigger action automatically.",
      "text": "Ways of Working (Execution OS) Cadence that makes execution measurable and fast. Cadence Forum Purpose Outputs Weekly Commercial pulse Sell-out, availability, promo compliance Actions, store priorities, evidence Monthly S&OP+ Demand/supply, portfolio, service Plan alignment, risk mitigation Quarterly Customer JBPs Growth plans with key customers Signed activity plans, funding Quarterly Innovation council NPD pipeline, kill/scale decisions Go/No-Go, launch quality Bi-monthly Field excellence Standards, training, best practices Scorecards, capability upgrades Principles If it’s not in the system with evidence, it didn’t happen One-page decisions with clear owners Less reporting, more action Speed enablers Simple dashboards with weekly thresholds Pre-agreed gates → automatic review Clear escalation paths"
    },
    {
      "key": "marketing",
      "name": "Marketing",
      "script": "Marketing accelerates what execution can deliver. In 2026 we focus investment on noodles and broth platforms and priority brands, digital-first activation, and sampling that drives repeat. Spend is ROI-tracked and capped. And we do not spend into poor availability.",
      "text": "Marketing & Campaign Plan Spend as investment — tied to availability and execution. 2026 priorities Focus platforms: noodles + broth + priority brands Digital-first demand creation and retail activation Sampling where it converts repeat Retail media and content tied to store availability A&P cap ≤ 9% (ROI tracked) Always-on measurement Incremental volume vs baseline Price/mix impact & GM effect Distribution and OSA impact Creative learning loop: test & learn No availability = no spend Guardrails Stop spending if OSA on focus SKUs is below threshold Promotions must be margin-accretive or strategic Campaigns require clear hypotheses and post-mortems"
    },
    {
      "key": "npd",
      "name": "NPD",
      "script": "Innovation must be meaningful. We focus on health and premium, with four to six high-quality launches per year and a clear KPI: at least twenty percent of sales coming from products younger than three years. We test fast, and we kill weak launches quickly.",
      "text": "NPD Plan — Health & Premium Focus ≥20% NS from products <3 years Pipeline design 4–6 meaningful launches per year (quality over quantity) Health cues: plant-based, protein, low salt where relevant Premium cues: taste, provenance, functional benefit Two-speed: fast tests + scaled winners Quality gate Weak launches are killed fast — no “zombie SKUs”. 2026–2027 examples (illustrative) Broth: premium + health variants (function + taste) Noodles: local flavors, premium bowls, better nutrition Foodservice formats: bulk, chef packs, easy prep"
    },
    {
      "key": "financials",
      "name": "Financials",
      "script": "This is the disciplined financial model: we grow to 100 million by 2029 while keeping overhead and A and P at or below nine percent each, and keeping gross margin above forty percent. The hard gate is 39.5 percent gross margin: if we breach it, we act immediately.",
      "text": "Financial Projections & Budget Framework Scale profitably — guardrails are not optional. Year Net Sales GM% A&P Overhead EBIT% 2025 63.1M€ 41.3% 5.6% ~8% 24% 2026 70–72M€ ≥40% ≤9% ≤9% 24–25% 2027 80–82M€ ≥40% ≤9% ≤9% ~25% 2028 90–92M€ 40–41% ≤9% ≤9% ~26% 2029 100M€ ≥41% ≤9% ≤9% 26–28% Hard gates Any quarter GM 39.5% → immediate mix/price/cost review. A&P and OH drift → immediate reallocation."
    },
    {
      "key": "kpis",
      "name": "KPIs",
      "script": "We measure what we want to happen. Our KPIs balance growth and quality: sales, gross margin, consumer NPS, overhead and A and P discipline, and innovation contribution. Lead indicators like availability, distribution, and promo compliance ensure we act early, not late.",
      "text": "Key Performance Indicators 100M€ Net Sales 2029 ≥40% GM floor >50 Consumer NPS ≤9% Overhead cap ≤9% A&P cap ≥20% Innovation revenue Hard gates (stop rules) GM Field force uplift Foodservice growth Lead indicators (weekly/monthly) OSA on focus SKUs Distribution & share of shelf Promo compliance with evidence Sell-out velocity vs baseline"
    },
    {
      "key": "tools_data",
      "name": "Tools & Data",
      "script": "Tools and data turn strategy into reality. We need a commercial execution stack for field evidence and dashboards, an S&OP plus backbone for demand and supply alignment, and a consumer insights system for learning. The rule is simple: data must trigger action, not reporting.",
      "text": "Tools, IT Systems & Data Architecture A single truth system that turns data into action. Commercial execution stack SFA / Field app: store tasks + photo evidence Weekly execution dashboards (OSA, compliance) Retail media tracking tied to store availability S&OP+ backbone Demand planning and forecast discipline Supply risk and OTIF monitoring Portfolio and SKU rationalization gates Consumer insights Continuous listening (social, search, surveys) Test & learn experiments and learning library Innovation scorecards (repeat intent, trial conversion) Rule If it’s not measured, it’s not managed If it’s not in the system with evidence, it didn’t happen Dashboards must trigger actions, not reports"
    },
    {
      "key": "risks",
      "name": "Risks",
      "script": "Risk management is built into the plan. Gross margin has a hard gate at 39.5 percent. Field force expansion has an uplift gate. Supply performance is managed through OTIF thresholds and S&OP escalation. And we prevent the biggest hidden risk: too many priorities.",
      "text": "Risks & Mitigation Measures We scale aggressively — with kill-switches. Risk Trigger Mitigation Gate GM erosion GM Mix, pricing, promo discipline, COGS actions Immediate review Field force cost without impact Uplift Pause rollout; redesign coverage & standards Pause Supply / service risk OTIF Safety stock, alternate suppliers, S&OP escalation Service plan Distributor underperformance 2 quarters below target Corrective plan; incentives; alternative RTM option Corrective plan Too many priorities WIP overload Stop/kill list; focus on engines Quarterly reset Risk posture We take risks on growth — not on margin quality We test fast, scale winners, kill losers Gates are pre-agreed to remove politics What we won’t do Spend A&P into poor availability Scale headcount without proven uplift Accept GM erosion as “temporary” without action"
    },
    {
      "key": "2026",
      "name": "Roadmap 2026",
      "script": "2026 is the validation year. We run the field force pilot and prove uplift, scale noodles through distribution and repeat, launch the first premium and health innovation wave, pilot foodservice expansion, and put dashboards and S&OP plus cadence in place.",
      "text": "Implementation Roadmap — 2026 Validate the engines. Prove what works. Set up scaling. Must deliver Field force pilot (5–10 reps) + evidence scorecard Noodles distribution & repeat plan (retail focus) Broth premium/health NPD wave 1 Foodservice expansion pilot (FI/NO) Execution dashboards + S&OP+ cadence running Gates & triggers Field uplift < 8% (mid-year) → pause rollout GM below 39.5% → price/mix/cost action OTIF below 90% → service escalation plan WIP overload → stop list and refocus 70–72M€ Target net sales ≥40% GM guardrail Pilot Field force proof"
    },
    {
      "key": "2027",
      "name": "Roadmap 2027",
      "script": "2027 is the scale year. If gates pass, we expand field force, accelerate noodles and broth platforms, professionalize foodservice with dedicated key account focus, and standardize the execution playbooks that make growth repeatable.",
      "text": "Implementation Roadmap — 2027 Scale the winners. Standardize execution. Scale-up moves Field force scale to 15–20 reps (if gates pass) Noodles platform expansion + stronger retail programs Foodservice KAM model + priority segments Innovation wave 2 with premiumization focus Capability upgrades Best practice playbooks by chain and format Retail media and digital amplification Supply resilience and service improvements Quarterly portfolio rationalization discipline 80–82M€ Target net sales ~25% EBIT% ambition Scale Execution winners"
    },
    {
      "key": "2028",
      "name": "Roadmap 2028",
      "script": "2028 is acceleration. We expand the proven platforms and playbooks, increase premium and health mix, and scale foodservice without damaging service or margin. Complexity is controlled through portfolio gates, stop lists, and strict cost caps.",
      "text": "Implementation Roadmap — 2028 Accelerate with governance — growth without chaos. Acceleration levers Platform expansion across Nordics with proven playbooks Increased mix from premium/health winners Foodservice momentum with sustainable service levels Automation: dashboards that trigger actions Complexity control Limit SKU proliferation (portfolio gates) Protect service and quality while scaling Keep OH and A&P within caps Stop list for low-ROI initiatives 90–92M€ Target net sales 40–41% GM% target band Speed Playbooks at scale"
    },
    {
      "key": "2029",
      "name": "Roadmap 2029",
      "script": "2029 is the landing. We achieve 100 million euros and, more importantly, we make it repeatable: stable platforms, disciplined execution culture, strong service, and financial quality that holds as we scale.",
      "text": "Implementation Roadmap — 2029 Land at 100M€ — and make it a repeatable system. 100M€ Net sales target What “win” looks like Strong platforms: noodles + broth + priority brands Execution culture with evidence-driven standards Stable service levels and reliable supply Innovation engine delivering meaningful share of sales Financial quality GM ≥ 41% and stable OH and A&P within caps EBIT 26–28% ambition band Growth that compounds, not resets"
    },
    {
      "key": "summary",
      "name": "Summary",
      "script": "To summarize: we scale to 100 million by building the noodles and broth engines, upgrading execution through route to market and a dedicated field force, and enforcing strict financial guardrails and gates. These non-negotiables make growth credible and repeatable.",
      "text": "Summary — What We Commit To The plan in one sentence Build noodles and broth as growth engines, upgrade execution through RTM and field force, and scale with strict financial gates. Consumer-first Evidence-led Gated scaling Non-negotiables GM protected (hard gate 39.5%) OH ≤9% and A&P ≤9% Scale field force only with proven uplift No spend without availability 63M€ Start 100M€ Destination 4 Pillars Gates Risk control"
    },
    {
      "key": "next_steps",
      "name": "Next Steps",
      "script": "The plan becomes real in the next 30, 60, and 90 days. We confirm priorities and funding, design and launch the field force pilot with clear measurement, lock focus SKUs and availability targets, refresh customer plans, and run the cadence. Today’s ask is alignment on the non-negotiables, the gates, and the ownership.",
      "text": "Next Steps (30/60/90 days) Turn strategy into action — with owners and dates. Next 30 days Confirm 2026 priorities & funding allocation Define field force pilot design + measurement Lock noodles & broth focus SKU list and OSA targets Set weekly cadence and dashboards Next 60 days Launch field pilot and store standards program Customer JBP refresh (top customers) NPD wave 1 briefs finalized + go/no-go gates Foodservice expansion pilot plan (FI/NO) Next 90 days First pilot results & corrective actions Execution scorecards running weekly Portfolio discipline: stop list and focus reset Supply resilience actions if needed (OTIF plan) Decision ask today Align on the non-negotiables and gates Approve pilot scope and measurement Confirm ownership and cadence Let’s execute. CONSUMER-OBSESSED • DISCIPLINED • UNSTOPPABLE"
    }
  ]
}